---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveTypeParam
source: html/5eeb9459-75b2-334a-7d2f-229ff7ddca9d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveTypeParam Property

"Point"

## Syntax (C#)
```csharp
public static ForgeTypeId PointAdaptiveTypeParam { get; }
```